//=============================================================================
//
// ロゴの処理 [logo.cpp]
// Author : Jukiya Hayakawa
//
//=============================================================================
#include "logo.h"
#include "renderer.h"
#include "manager.h"
#include "input.h"

//=============================================================================
// ロゴのコンストラクタ
//=============================================================================
CLogo::CLogo(int nPriority) : CScene(nPriority,OBJTYPE_SCENE2D)
{
	m_pTexture = NULL;							//テクスチャ
	m_col = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);	//色の初期値
}
//=============================================================================
// ロゴのデストラクタ
//=============================================================================
CLogo::~CLogo()
{

}

//=============================================================================
// ロゴの初期化処理
//=============================================================================
HRESULT CLogo::Init(void)
{
	//レンダリングの取得
	CRenderer *pRenderer;
	pRenderer = CManager::GetRenderer();

	//ポインタの取得
	LPDIRECT3DDEVICE9 pDevice;
	pDevice = pRenderer->GetDevice();

	//頂点バッファの生成
	pDevice->CreateVertexBuffer(sizeof(VERTEX_2D) * 4,
		D3DUSAGE_WRITEONLY,
		FVF_VERTEX_2D,
		D3DPOOL_MANAGED,
		&m_pVtxBuff,
		NULL);

	VERTEX_2D*pVtx;	//頂点情報へのポインタ

					//頂点バッファをロックし、頂点データへのポインタを取得
	m_pVtxBuff->Lock(0, 0, (void**)& pVtx, 0);

	//頂点座標の設定
	pVtx[0].pos = D3DXVECTOR3(m_pos.x - m_fWidth, m_pos.y - m_fHeight, 0.0f);
	pVtx[1].pos = D3DXVECTOR3(m_pos.x + m_fWidth, m_pos.y - m_fHeight, 0.0f);
	pVtx[2].pos = D3DXVECTOR3(m_pos.x - m_fWidth, m_pos.y + m_fHeight, 0.0f);
	pVtx[3].pos = D3DXVECTOR3(m_pos.x + m_fWidth, m_pos.y + m_fHeight, 0.0f);

	//rhwの設定
	pVtx[0].rhw = 1.0f;
	pVtx[1].rhw = 1.0f;
	pVtx[2].rhw = 1.0f;
	pVtx[3].rhw = 1.0f;

	//頂点カラーの設定
	pVtx[0].col = m_col;
	pVtx[1].col = m_col;
	pVtx[2].col = m_col;
	pVtx[3].col = m_col;

	//テクスチャ座標の設定
	pVtx[0].tex = D3DXVECTOR2(0.0f, 0.0f);
	pVtx[1].tex = D3DXVECTOR2(1.0f, 0.0f);
	pVtx[2].tex = D3DXVECTOR2(0.0f, 1.0f);
	pVtx[3].tex = D3DXVECTOR2(1.0f, 1.0f);

	//頂点バッファをアンロックする
	m_pVtxBuff->Unlock();

	return S_OK;
}

//=============================================================================
// ロゴの終了処理
//=============================================================================
void CLogo::Uninit(void)
{
	// 頂点バッファの破棄
	if (m_pVtxBuff != NULL)
	{
		m_pVtxBuff->Release();
		m_pVtxBuff = NULL;
	}
	Release();
}

//=============================================================================
// ロゴの更新処理
//=============================================================================
void CLogo::Update(void)
{

}

//=============================================================================
// ロゴの描画処理
//=============================================================================
void CLogo::Draw(void)
{
	//レンダリングの取得
	CRenderer *pRenderer;
	pRenderer = CManager::GetRenderer();

	//デバイスの取得
	LPDIRECT3DDEVICE9 pDevice;
	pDevice = pRenderer->GetDevice();

	//頂点バッファをデバイスのデータストリームに設定
	pDevice->SetStreamSource(0, m_pVtxBuff, 0, sizeof(VERTEX_2D));

	//頂点フォーマットの設定
	pDevice->SetFVF(FVF_VERTEX_2D);

	//テクスチャの設定
	pDevice->SetTexture(0, m_pTexture);

	//ポリゴンの描画
	pDevice->DrawPrimitive(D3DPT_TRIANGLESTRIP, 0, 2);
}
//=============================================================================
// オブジェクトの取得処理
//=============================================================================
void CLogo::BindTexture(LPDIRECT3DTEXTURE9 texture)
{
	m_pTexture = texture;
}
//=============================================================================
// ロゴの位置設置処理
//=============================================================================
void CLogo::SetPos(D3DXVECTOR3 pos)
{
	m_pos = pos;
}

//=============================================================================
// ロゴの位置設置処理
//=============================================================================
void CLogo::SetWidth(float fWidth)
{
	m_fWidth = fWidth;
}
//=============================================================================
// ロゴの位置設置処理
//=============================================================================
void CLogo::SetHeight(float fHeight)
{
	m_fHeight = fHeight;
}
//=============================================================================
// ロゴの色設置処理
//=============================================================================
void CLogo::SetCol(D3DXCOLOR col)
{
	m_col = col;
}

//=============================================================================
//
// タイトルロゴの処理
//
//=============================================================================
//=============================================================================
// 静的メンバ変数宣言
//=============================================================================
LPDIRECT3DTEXTURE9 CTitleLogo::m_pTexture;
//=============================================================================
// タイトルロゴのコンストラクタ
//=============================================================================
CTitleLogo::CTitleLogo() : CLogo()
{
}
//=============================================================================
// タイトルロゴのデストラクタ
//=============================================================================
CTitleLogo::~CTitleLogo()
{
}

//=============================================================================
//タイトルロゴの生成
//=============================================================================
CTitleLogo *CTitleLogo::Create(D3DXVECTOR3 pos, float fWidth, float fHeight)
{
	CTitleLogo *pTitleLogo = NULL;
	if (pTitleLogo == NULL)
	{
		pTitleLogo = new CTitleLogo;				//シーンの動的確保
		if (pTitleLogo != NULL)
		{
			pTitleLogo->SetPos(pos);				//位置の設置
			pTitleLogo->SetWidth(fWidth);			//幅の設置
			pTitleLogo->SetHeight(fHeight);			//高さの設置
			pTitleLogo->BindTexture(m_pTexture);	//テクスチャ
			pTitleLogo->Init();						//初期化処理
		}
	}
	return pTitleLogo;								//値を返す
}

//=============================================================================
// オブジェクトのテクスチャ読み込み
//=============================================================================
HRESULT CTitleLogo::Load(void)
{
	//レンダリングの取得
	CRenderer *pRenderer;
	pRenderer = CManager::GetRenderer();

	//デバイスの取得
	LPDIRECT3DDEVICE9 pDevice;
	pDevice = pRenderer->GetDevice();

	//テクスチャの読み込み
	D3DXCreateTextureFromFile(pDevice,
		"data\\TEXTURE\\titlelogo.png",
		&m_pTexture);

	return S_OK;
}

//=============================================================================
// オブジェクトのテクスチャ破棄
//=============================================================================
void CTitleLogo::Unload(void)
{
	// テクスチャの破棄
	if (m_pTexture != NULL)
	{
		m_pTexture->Release();
		m_pTexture = NULL;
	}
}

//=============================================================================
// タイトルロゴの初期化処理
//=============================================================================
HRESULT CTitleLogo::Init(void)
{
	//ロゴの描画処理
	CLogo::Init();

	return S_OK;
}

//=============================================================================
// タイトルロゴの終了処理
//=============================================================================
void CTitleLogo::Uninit(void)
{
	//終了処理
	CLogo::Uninit();
}

//=============================================================================
// タイトルロゴの更新処理
//=============================================================================
void CTitleLogo::Update(void)
{

}

//=============================================================================
// タイトルロゴの描画処理
//=============================================================================
void CTitleLogo::Draw(void)
{
	//ロゴの描画処理
	CLogo::Draw();
}

//=============================================================================
//
// チュートリアル処理
//
//=============================================================================
//=============================================================================
// 静的メンバ変数宣言
//=============================================================================
LPDIRECT3DTEXTURE9 CTutorialLogo::m_pTexture = NULL;

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// グローバル変数
//=============================================================================

//=============================================================================
// チュートリアルコンストラクタ
//=============================================================================
CTutorialLogo::CTutorialLogo() : CLogo()
{
}
//=============================================================================
// チュートリアルデストラクタ
//=============================================================================
CTutorialLogo::~CTutorialLogo()
{
}

//=============================================================================
//チュートリアル生成
//=============================================================================
CTutorialLogo *CTutorialLogo::Create(D3DXVECTOR3 pos, float fWidth, float fHeight)
{
	CTutorialLogo *pTutorialLogo = NULL;
	if (pTutorialLogo == NULL)
	{
		pTutorialLogo = new CTutorialLogo;		//シーンの動的確保
		if (pTutorialLogo != NULL)
		{
			pTutorialLogo->SetPos(pos);		//位置の設置
			pTutorialLogo->SetWidth(fWidth);	//幅の設置
			pTutorialLogo->SetHeight(fHeight);//高さの設置
			pTutorialLogo->BindTexture(m_pTexture);
			pTutorialLogo->Init();					//初期化処理
		}
	}
	return pTutorialLogo;					//値を返す
}

//=============================================================================
// オブジェクトのテクスチャ読み込み
//=============================================================================
HRESULT CTutorialLogo::Load(void)
{
	//レンダリングの取得
	CRenderer *pRenderer;
	pRenderer = CManager::GetRenderer();

	//デバイスの取得
	LPDIRECT3DDEVICE9 pDevice;
	pDevice = pRenderer->GetDevice();

	//テクスチャの読み込み
	D3DXCreateTextureFromFile(pDevice,
		"data\\TEXTURE\\tutorialBG.png",
		&m_pTexture);

	return S_OK;
}

//=============================================================================
// オブジェクトのテクスチャ破棄
//=============================================================================
void CTutorialLogo::Unload(void)
{
	// テクスチャの破棄
	if (m_pTexture != NULL)
	{
		m_pTexture->Release();
		m_pTexture = NULL;
	}

}

//=============================================================================
// チュートリアル初期化処理
//=============================================================================
HRESULT CTutorialLogo::Init(void)
{
	//ロゴの描画処理
	CLogo::Init();

	return S_OK;
}

//=============================================================================
// チュートリアル終了処理
//=============================================================================
void CTutorialLogo::Uninit(void)
{
	//終了処理
	CLogo::Uninit();
}

//=============================================================================
// チュートリアル更新処理
//=============================================================================
void CTutorialLogo::Update(void)
{

}

//=============================================================================
// チュートリアル描画処理
//=============================================================================
void CTutorialLogo::Draw(void)
{
	//ロゴの描画処理
	CLogo::Draw();
}


//=============================================================================
//
// リザルトロゴの処理
//
//=============================================================================
//=============================================================================
// 静的メンバ変数宣言
//=============================================================================
LPDIRECT3DTEXTURE9 CResultLogo::m_pTexture = NULL;

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// グローバル変数
//=============================================================================

//=============================================================================
// リザルトロゴのコンストラクタ
//=============================================================================
CResultLogo::CResultLogo() : CLogo()
{
}
//=============================================================================
// リザルトロゴのデストラクタ
//=============================================================================
CResultLogo::~CResultLogo()
{
}

//=============================================================================
//リザルトロゴの生成
//=============================================================================
CResultLogo *CResultLogo::Create(D3DXVECTOR3 pos, float fWidth, float fHeight)
{
	CResultLogo *pResultLogo = NULL;
	if (pResultLogo == NULL)
	{
		pResultLogo = new CResultLogo;		//シーンの動的確保
		if (pResultLogo != NULL)
		{
			pResultLogo->SetPos(pos);		//位置の設置
			pResultLogo->SetWidth(fWidth);	//幅の設置
			pResultLogo->SetHeight(fHeight);//高さの設置
			pResultLogo->BindTexture(m_pTexture);
pResultLogo->Init();					//初期化処理
		}
	}
	return pResultLogo;					//値を返す
}

//=============================================================================
// オブジェクトのテクスチャ読み込み
//=============================================================================
HRESULT CResultLogo::Load(void)
{
	//レンダリングの取得
	CRenderer *pRenderer;
	pRenderer = CManager::GetRenderer();

	//デバイスの取得
	LPDIRECT3DDEVICE9 pDevice;
	pDevice = pRenderer->GetDevice();

	//テクスチャの読み込み
	D3DXCreateTextureFromFile(pDevice,
		"data\\TEXTURE\\resultlogo.png",
		&m_pTexture);

	return S_OK;
}

//=============================================================================
// オブジェクトのテクスチャ破棄
//=============================================================================
void CResultLogo::Unload(void)
{
		// テクスチャの破棄
		if (m_pTexture != NULL)
		{
			m_pTexture->Release();
			m_pTexture = NULL;
		}

}

//=============================================================================
// リザルトロゴの初期化処理
//=============================================================================
HRESULT CResultLogo::Init(void)
{
	//ロゴの描画処理
	CLogo::Init();

	return S_OK;
}

//=============================================================================
// リザルトロゴの終了処理
//=============================================================================
void CResultLogo::Uninit(void)
{
	//終了処理
	CLogo::Uninit();
}

//=============================================================================
// リザルトロゴの更新処理
//=============================================================================
void CResultLogo::Update(void)
{

}

//=============================================================================
// リザルトロゴの描画処理
//=============================================================================
void CResultLogo::Draw(void)
{
	//ロゴの描画処理
	CLogo::Draw();
}

//=============================================================================
//
// リザルトスコアロゴの処理
//
//=============================================================================
//=============================================================================
// 静的メンバ変数宣言
//=============================================================================
LPDIRECT3DTEXTURE9 CResultScoreLogo::m_pTexture = NULL;

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// グローバル変数
//=============================================================================

//=============================================================================
// リザルトロゴのコンストラクタ
//=============================================================================
CResultScoreLogo::CResultScoreLogo() : CLogo()
{
}
//=============================================================================
// リザルトロゴのデストラクタ
//=============================================================================
CResultScoreLogo::~CResultScoreLogo()
{
}

//=============================================================================
//リザルトロゴの生成
//=============================================================================
CResultScoreLogo *CResultScoreLogo::Create(D3DXVECTOR3 pos, float fWidth, float fHeight)
{
	CResultScoreLogo *pResultScoreLogo = NULL;
	if (pResultScoreLogo == NULL)
	{
		pResultScoreLogo = new CResultScoreLogo;		//シーンの動的確保
		if (pResultScoreLogo != NULL)
		{
			pResultScoreLogo->SetPos(pos);		//位置の設置
			pResultScoreLogo->SetWidth(fWidth);	//幅の設置
			pResultScoreLogo->SetHeight(fHeight);//高さの設置
			pResultScoreLogo->BindTexture(m_pTexture);
			pResultScoreLogo->Init();					//初期化処理
		}
	}
	return pResultScoreLogo;					//値を返す
}

//=============================================================================
// オブジェクトのテクスチャ読み込み
//=============================================================================
HRESULT CResultScoreLogo::Load(void)
{
	//レンダリングの取得
	CRenderer *pRenderer;
	pRenderer = CManager::GetRenderer();

	//デバイスの取得
	LPDIRECT3DDEVICE9 pDevice;
	pDevice = pRenderer->GetDevice();

	//テクスチャの読み込み
	D3DXCreateTextureFromFile(pDevice,
		"data\\TEXTURE\\resultscore.png",
		&m_pTexture);

	return S_OK;
}

//=============================================================================
// オブジェクトのテクスチャ破棄
//=============================================================================
void CResultScoreLogo::Unload(void)
{
	// テクスチャの破棄
	if (m_pTexture != NULL)
	{
		m_pTexture->Release();
		m_pTexture = NULL;
	}

}

//=============================================================================
// リザルトロゴの初期化処理
//=============================================================================
HRESULT CResultScoreLogo::Init(void)
{
	//ロゴの描画処理
	CLogo::Init();

	return S_OK;
}

//=============================================================================
// リザルトロゴの終了処理
//=============================================================================
void CResultScoreLogo::Uninit(void)
{
	//終了処理
	CLogo::Uninit();
}

//=============================================================================
// リザルトロゴの更新処理
//=============================================================================
void CResultScoreLogo::Update(void)
{

}

//=============================================================================
// リザルトロゴの描画処理
//=============================================================================
void CResultScoreLogo::Draw(void)
{
	//ロゴの描画処理
	CLogo::Draw();
}

//=============================================================================
//
// ランキングロゴの処理
//
//=============================================================================
//=============================================================================
// 静的メンバ変数宣言
//=============================================================================
LPDIRECT3DTEXTURE9 CRankingLogo::m_pTexture;

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// グローバル変数
//=============================================================================

//=============================================================================
// ランキングロゴのコンストラクタ
//=============================================================================
CRankingLogo::CRankingLogo() : CLogo()
{
}
//=============================================================================
// ランキングロゴのデストラクタ
//=============================================================================
CRankingLogo::~CRankingLogo()
{
}

//=============================================================================
//ランキングロゴの生成
//=============================================================================
CRankingLogo *CRankingLogo::Create(D3DXVECTOR3 pos, float fWidth, float fHeight)
{
	CRankingLogo *pRankingLogo = NULL;
	if (pRankingLogo == NULL)
	{
		pRankingLogo = new CRankingLogo;		//シーンの動的確保
		if (pRankingLogo != NULL)
		{
			pRankingLogo->SetPos(pos);				//位置の設置
			pRankingLogo->SetWidth(fWidth);			//幅の設置
			pRankingLogo->SetHeight(fHeight);		//高さの設置
			pRankingLogo->BindTexture(m_pTexture);	//テクスチャ
			pRankingLogo->Init();					//初期化処理
		}
	}
	return pRankingLogo;					//値を返す
}

//=============================================================================
// オブジェクトのテクスチャ読み込み
//=============================================================================
HRESULT CRankingLogo::Load(void)
{
	//レンダリングの取得
	CRenderer *pRenderer;
	pRenderer = CManager::GetRenderer();

	//デバイスの取得
	LPDIRECT3DDEVICE9 pDevice;
	pDevice = pRenderer->GetDevice();

	//テクスチャの読み込み
	D3DXCreateTextureFromFile(pDevice,
		"data\\TEXTURE\\rankinglogo.png",
		&m_pTexture);

	return S_OK;
}

//=============================================================================
// オブジェクトのテクスチャ破棄
//=============================================================================
void CRankingLogo::Unload(void)
{
	// テクスチャの破棄
	if (m_pTexture != NULL)
	{
		m_pTexture->Release();
		m_pTexture = NULL;
	}
}

//=============================================================================
// ランキングロゴの初期化処理
//=============================================================================
HRESULT CRankingLogo::Init(void)
{
	//ロゴの描画処理
	CLogo::Init();

	return S_OK;
}

//=============================================================================
// ランキングロゴの終了処理
//=============================================================================
void CRankingLogo::Uninit(void)
{
	//終了処理
	CLogo::Uninit();
}

//=============================================================================
// ランキングロゴの更新処理
//=============================================================================
void CRankingLogo::Update(void)
{

}

//=============================================================================
// ランキングロゴの描画処理
//=============================================================================
void CRankingLogo::Draw(void)
{
	//ロゴの描画処理
	CLogo::Draw();
}


//=============================================================================
//
// ランキングロゴの処理
//
//=============================================================================
//=============================================================================
// 静的メンバ変数宣言
//=============================================================================
LPDIRECT3DTEXTURE9 CRankingRank::m_pTexture;

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// グローバル変数
//=============================================================================

//=============================================================================
// ランキングロゴのコンストラクタ
//=============================================================================
CRankingRank::CRankingRank() : CLogo()
{
}
//=============================================================================
// ランキングロゴのデストラクタ
//=============================================================================
CRankingRank::~CRankingRank()
{
}

//=============================================================================
//ランキングロゴの生成
//=============================================================================
CRankingRank *CRankingRank::Create(D3DXVECTOR3 pos, float fWidth, float fHeight)
{
	CRankingRank *pRankingRank = NULL;
	if (pRankingRank == NULL)
	{
		pRankingRank = new CRankingRank;		//シーンの動的確保
		if (pRankingRank != NULL)
		{
			pRankingRank->SetPos(pos);				//位置の設置
			pRankingRank->SetWidth(fWidth);			//幅の設置
			pRankingRank->SetHeight(fHeight);		//高さの設置
			pRankingRank->BindTexture(m_pTexture);	//テクスチャ
			pRankingRank->Init();					//初期化処理
		}
	}
	return pRankingRank;					//値を返す
}

//=============================================================================
// オブジェクトのテクスチャ読み込み
//=============================================================================
HRESULT CRankingRank::Load(void)
{
	//レンダリングの取得
	CRenderer *pRenderer;
	pRenderer = CManager::GetRenderer();

	//デバイスの取得
	LPDIRECT3DDEVICE9 pDevice;
	pDevice = pRenderer->GetDevice();

	//テクスチャの読み込み
	D3DXCreateTextureFromFile(pDevice,
		"data\\TEXTURE\\rankingrank.png",
		&m_pTexture);

	return S_OK;
}

//=============================================================================
// オブジェクトのテクスチャ破棄
//=============================================================================
void CRankingRank::Unload(void)
{
	// テクスチャの破棄
	if (m_pTexture != NULL)
	{
		m_pTexture->Release();
		m_pTexture = NULL;
	}
}

//=============================================================================
// ランキングロゴの初期化処理
//=============================================================================
HRESULT CRankingRank::Init(void)
{
	//ロゴの描画処理
	CLogo::Init();

	return S_OK;
}

//=============================================================================
// ランキングロゴの終了処理
//=============================================================================
void CRankingRank::Uninit(void)
{
	//終了処理
	CLogo::Uninit();
}

//=============================================================================
// ランキングロゴの更新処理
//=============================================================================
void CRankingRank::Update(void)
{

}

//=============================================================================
// ランキングロゴの描画処理
//=============================================================================
void CRankingRank::Draw(void)
{
	//ロゴの描画処理
	CLogo::Draw();
}


//=============================================================================
//
// HPロゴの処理
//
//=============================================================================
//=============================================================================
// 静的メンバ変数宣言
//=============================================================================
LPDIRECT3DTEXTURE9 CHPLogo::m_pTexture;

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// グローバル変数
//=============================================================================

//=============================================================================
// HPロゴのコンストラクタ
//=============================================================================
CHPLogo::CHPLogo() : CLogo(6)
{
}
//=============================================================================
// HPロゴのデストラクタ
//=============================================================================
CHPLogo::~CHPLogo()
{
}

//=============================================================================
//HPロゴの生成
//=============================================================================
CHPLogo *CHPLogo::Create(D3DXVECTOR3 pos, float fWidth, float fHeight)
{
	CHPLogo *pStatusLogo = NULL;
	if (pStatusLogo == NULL)
	{
		pStatusLogo = new CHPLogo;		//シーンの動的確保
		if (pStatusLogo != NULL)
		{
			pStatusLogo->SetPos(pos);				//位置の設置
			pStatusLogo->SetWidth(fWidth);			//幅の設置
			pStatusLogo->SetHeight(fHeight);		//高さの設置
			pStatusLogo->BindTexture(m_pTexture);	//テクスチャ
			pStatusLogo->Init();					//初期化処理
		}
	}
	return pStatusLogo;					//値を返す
}

//=============================================================================
// オブジェクトのテクスチャ読み込み
//=============================================================================
HRESULT CHPLogo::Load(void)
{
	//レンダリングの取得
	CRenderer *pRenderer;
	pRenderer = CManager::GetRenderer();

	//デバイスの取得
	LPDIRECT3DDEVICE9 pDevice;
	pDevice = pRenderer->GetDevice();

	//テクスチャの読み込み
	D3DXCreateTextureFromFile(pDevice,
		"data\\TEXTURE\\UI_HP.png",
		&m_pTexture);

	return S_OK;
}

//=============================================================================
// オブジェクトのテクスチャ破棄
//=============================================================================
void CHPLogo::Unload(void)
{
	// テクスチャの破棄
	if (m_pTexture != NULL)
	{
		m_pTexture->Release();
		m_pTexture = NULL;
	}
}

//=============================================================================
// HPロゴの初期化処理
//=============================================================================
HRESULT CHPLogo::Init(void)
{
	//ロゴの描画処理
	CLogo::Init();

	return S_OK;
}

//=============================================================================
// HPロゴの終了処理
//=============================================================================
void CHPLogo::Uninit(void)
{
	//終了処理
	CLogo::Uninit();
}

//=============================================================================
// HPロゴの更新処理
//=============================================================================
void CHPLogo::Update(void)
{
}

//=============================================================================
// HPロゴの描画処理
//=============================================================================
void CHPLogo::Draw(void)
{
	//ロゴの描画処理
	CLogo::Draw();
}

//=============================================================================
//
// MPロゴの処理
//
//=============================================================================
//=============================================================================
// 静的メンバ変数宣言
//=============================================================================
LPDIRECT3DTEXTURE9 CMPLogo::m_pTexture;

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// グローバル変数
//=============================================================================

//=============================================================================
// MPロゴのコンストラクタ
//=============================================================================
CMPLogo::CMPLogo() : CLogo(6)
{
}
//=============================================================================
// MPロゴのデストラクタ
//=============================================================================
CMPLogo::~CMPLogo()
{
}

//=============================================================================
//MPロゴの生成
//=============================================================================
CMPLogo *CMPLogo::Create(D3DXVECTOR3 pos, float fWidth, float fHeight)
{
	CMPLogo *pStatusLogo = NULL;
	if (pStatusLogo == NULL)
	{
		pStatusLogo = new CMPLogo;		//シーンの動的確保
		if (pStatusLogo != NULL)
		{
			pStatusLogo->SetPos(pos);				//位置の設置
			pStatusLogo->SetWidth(fWidth);			//幅の設置
			pStatusLogo->SetHeight(fHeight);		//高さの設置
			pStatusLogo->BindTexture(m_pTexture);	//テクスチャ
			pStatusLogo->Init();					//初期化処理
		}
	}
	return pStatusLogo;					//値を返す
}

//=============================================================================
// オブジェクトのテクスチャ読み込み
//=============================================================================
HRESULT CMPLogo::Load(void)
{
	//レンダリングの取得
	CRenderer *pRenderer;
	pRenderer = CManager::GetRenderer();

	//デバイスの取得
	LPDIRECT3DDEVICE9 pDevice;
	pDevice = pRenderer->GetDevice();

	//テクスチャの読み込み
	D3DXCreateTextureFromFile(pDevice,
		"data\\TEXTURE\\UI_MP.png",
		&m_pTexture);

	return S_OK;
}

//=============================================================================
// オブジェクトのテクスチャ破棄
//=============================================================================
void CMPLogo::Unload(void)
{
	// テクスチャの破棄
	if (m_pTexture != NULL)
	{
		m_pTexture->Release();
		m_pTexture = NULL;
	}
}

//=============================================================================
// MPロゴの初期化処理
//=============================================================================
HRESULT CMPLogo::Init(void)
{
	//ロゴの描画処理
	CLogo::Init();

	return S_OK;
}

//=============================================================================
// MPロゴの終了処理
//=============================================================================
void CMPLogo::Uninit(void)
{
	//終了処理
	CLogo::Uninit();
}

//=============================================================================
// MPロゴの更新処理
//=============================================================================
void CMPLogo::Update(void)
{
}

//=============================================================================
// MPロゴの描画処理
//=============================================================================
void CMPLogo::Draw(void)
{
	//ロゴの描画処理
	CLogo::Draw();
}