//=============================================================================
//
// タイトルの処理 [title.h]
// Author : Jukiya Hayakawa
//
//=============================================================================
#ifndef _TITLE_H_
#define _TITLE_H_

#include "main.h"

class CMap;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CTitle
{
public:	//誰からもアクセス可能
	//=========================================================================
	// 構造体の定義
	//=========================================================================

	//メンバ関数
	CTitle();
	~CTitle();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	//静的メンバ関数
	static CTitle *Create(void);

private:	//自分だけがアクセス可能
	int					m_ntimer;

	static CMap				*m_pMap;		//マップのポインタ

};
#endif