//=============================================================================
//
// カメラ処理 [camera.cpp]
// Author : Hodaka Niwa
//
//=============================================================================
#include "camera.h"
#include "input.h"
#include "main.h"
#include "manager.h"
#include "renderer.h"
#include "debugproc.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define CAMERA_ANGEL_VIEW      (45.0f)                           // カメラの画角
#define CHARACAMERA_ANGEL_VIEW (30.0f)                           // キャラセレクトカメラの画角
#define CAMERA_ANGLE_SPEED     (0.01f)                           // カメラをマウスで回転させるスピード倍率
#define CAMERA_MOVE_SPEED      (1.3f)                            // カメラをマウスで移動させるスピード倍率
#define CAMERA_LENGTH_MIN      (100.0f)                          // 視点注視点の距離の最小値
#define CAMERA_LENGTH_MAX      (1700.0f)                         // 視点注視点の距離の最大値

#define CAMERA_LENGTH_INI      (1700.0f)                         // 視点注視点間の距離(初期値)
#define CAMERA_ROT_INI         (D3DXVECTOR3(-1.2f,0.0f,0.0f))    // カメラの向き(初期値)
#define TOPVIEW_CAMERA_ROT_INI (D3DXVECTOR3(-1.57f,0.0f,0.0f))   // トップビューカメラの向き(初期値)
#define CAMERA_MOVE            (3.0f)                            // カメラの動くスピード
#define CAMERA_POS_X           (175.0f)

//*****************************************************************************
// 静的メンバ変数宣言
//*****************************************************************************

//*****************************************************************************
// CCameraの処理
//*****************************************************************************
//=============================================================================
// コンストラクタ
//=============================================================================
CCamera::CCamera()
{

}

//=============================================================================
// デストラクタ
//=============================================================================
CCamera::~CCamera()
{

}

//=============================================================================
// 生成処理
//=============================================================================
CCamera *CCamera::Create(void)
{
	CCamera *pCamera = NULL;

	if (pCamera == NULL)
	{
		pCamera = new CCamera;
		pCamera->Init();
	}
	return pCamera;
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CCamera::Init(void)
{
	// カメラの初期情報を設定
	m_Type = TYPE_NONE;                              // カメラの種類
	m_vecU = D3DXVECTOR3(0.0f, 1.0f, 0.0f);          // カメラの上方向ベクトル
	m_posR = D3DXVECTOR3(CAMERA_POS_X, 0.0f, 0.0f);  // カメラの注視点
	m_rot = CAMERA_ROT_INI;                          // カメラの現在の向き
	m_rotDest = m_rot;                               // カメラの目的の向き
	m_rotDiff = INITIALIZE_D3DXVECTOR3;              // 現在の向きと目的の向きの差分
	m_fLength = CAMERA_LENGTH_INI;                   // 視点注視点間の距離
	m_bMouseMove = true;                             // マウスで動かせるかどうか
	m_bChengeLength = true;                          // 視点注視点間の距離を変更できるかどうか

	// カメラの視点の位置を計算
	m_posV = D3DXVECTOR3(CAMERA_POS_X, 0.0f, 0.0f);
	m_posV.y = m_posR.y - sinf(m_rot.x) * m_fLength;
	m_posV.z = m_posR.z - cosf(m_rot.x) * m_fLength;

	// カメラの画角を設定
	m_fAngleOfView = CAMERA_ANGEL_VIEW;

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CCamera::Uninit(void)
{
}

//=============================================================================
// 更新処理
//=============================================================================
void CCamera::Update(void)
{

}

//=============================================================================
// カメラのリセット処理
//=============================================================================
void CCamera::Reset(void)
{
	m_rot = CAMERA_ROT_INI;
	m_fLength = CAMERA_LENGTH_INI;

	// 視点注視点の位置を設定
	m_posR = INITIALIZE_D3DXVECTOR3;
	m_posV.y = m_posR.y - sinf(m_rot.x) * m_fLength;
	m_posV.z = m_posR.z - cosf(m_rot.x) * m_fLength;
}

//=============================================================================
// カメラの設定処理
//=============================================================================
void CCamera::SetCamera(void)
{
	//レンダリングの取得
	CRenderer *pRenderer;
	pRenderer = CManager::GetRenderer();

	//デバイスの取得
	LPDIRECT3DDEVICE9 pDevice;
	pDevice = pRenderer->GetDevice();

	// プロジェクションマトリックスの初期化
	D3DXMatrixIdentity(&m_mtxProjection);

	// プロジェクションマトリックスを作成
	D3DXMatrixPerspectiveFovLH(&m_mtxProjection,
		D3DXToRadian(m_fAngleOfView),				//画角
		(float)SCREEN_WIDTH / (float)SCREEN_HEIGHT,	//画面比率
		10.0f,										//手前
		20000.0f);									//奥行き

	// プロジェクションマトリックスの設定
	pDevice->SetTransform(D3DTS_PROJECTION, &m_mtxProjection);

	// ビューマトリックスの初期化
	D3DXMatrixIdentity(&m_mtxView);

	// ビューマトリックスを作成
	D3DXMatrixLookAtLH(&m_mtxView,
				       &m_posV,
					   &m_posR,
					   &m_vecU);

	// ビューマトリックスの設定
	pDevice->SetTransform(D3DTS_VIEW, &m_mtxView);
}

//=============================================================================
// カメラの種類を取得
//=============================================================================
CCamera::TYPE CCamera::GetType(void)
{
	return m_Type;
}

//=============================================================================
// カメラの視点取得
//=============================================================================
D3DXVECTOR3 CCamera::GetPosV(void)
{
	return m_posV;
}

//=============================================================================
// カメラの注視点取得
//=============================================================================
D3DXVECTOR3 CCamera::GetPosR(void)
{
	return m_posR;
}

//=============================================================================
// カメラの向き取得
//=============================================================================
D3DXVECTOR3 CCamera::GetRot(void)
{
	return m_rot;
}

//=============================================================================
// カメラの長さ取得
//=============================================================================
float CCamera::GetLength(void)
{
	return m_fLength;
}

//=============================================================================
// カメラをマウスで動かせるかどうか取得
//=============================================================================
bool CCamera::GetMouseMove(void)
{
	return m_bMouseMove;
}

//=============================================================================
// カメラの視点注視点間の距離を変更できるかどうか取得
//=============================================================================
bool CCamera::GetChengeLength(void)
{
	return m_bChengeLength;
}

//=============================================================================
// カメラの画角を取得
//=============================================================================
float CCamera::GetAngleOfView(void)
{
	return m_fAngleOfView;
}

//=============================================================================
// カメラの種類設置処理
//=============================================================================
void CCamera::SetType(TYPE type)
{
	m_Type = type;
}

//=============================================================================
// カメラの視点設置処理
//=============================================================================
void CCamera::SetPosV(D3DXVECTOR3 posV)
{
	m_posV = posV;
}

//=============================================================================
// カメラの注視点設置処理
//=============================================================================
void CCamera::SetPosR(D3DXVECTOR3 posR)
{
	m_posR = posR;
}

//=============================================================================
// カメラの向き設定処理
//=============================================================================
void CCamera::SetRot(D3DXVECTOR3 Rot)
{
	m_rot = Rot;
}

//=============================================================================
// カメラの視点注視点間の距離設定処理
//=============================================================================
void CCamera::SetLength(float fLength)
{
	m_fLength = fLength;
}

//=============================================================================
// カメラをマウスで動かせるかどうか設定
//=============================================================================
void CCamera::SetMouseMove(bool bMouseMove)
{
	m_bMouseMove = bMouseMove;
}

//=============================================================================
// カメラの視点注視点間の距離を変更できるかどうか設定
//=============================================================================
void CCamera::SetChengeLength(bool bChengeLength)
{
	m_bChengeLength = bChengeLength;
}

//=============================================================================
// カメラの画角を設定
//=============================================================================
void CCamera::SetAngleOfView(float fAngleOfView)
{
	m_fAngleOfView = fAngleOfView;
}


//*****************************************************************************
// CCharaSelectCameraの処理
//*****************************************************************************
//=============================================================================
// コンストラクタ
//=============================================================================
CCharaSelectCamera::CCharaSelectCamera()
{

}

//=============================================================================
// デストラクタ
//=============================================================================
CCharaSelectCamera::~CCharaSelectCamera()
{

}

//=============================================================================
// 生成処理
//=============================================================================
CCharaSelectCamera *CCharaSelectCamera::Create(D3DXVECTOR3 posV, D3DXVECTOR3 posR)
{
	CCharaSelectCamera *pCharaSelectCamera = NULL;

	if (pCharaSelectCamera == NULL)
	{
		pCharaSelectCamera = new CCharaSelectCamera;
		pCharaSelectCamera->Init(posV, posR);
	}
	return pCharaSelectCamera;
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CCharaSelectCamera::Init(D3DXVECTOR3 posV, D3DXVECTOR3 posR)
{
	// 共通の初期化処理
	CCamera::Init();

	// 種類を設定
	SetType(TYPE_CHARASELECT);

	// 視点と注視点を改めて設定する
	SetPosV(posV);
	SetPosR(posR);

	// カメラの画角を設定
	SetAngleOfView(CHARACAMERA_ANGEL_VIEW);

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CCharaSelectCamera::Uninit(void)
{
	// 共通の終了処理
	CCamera::Uninit();
}

//=============================================================================
// 更新処理
//=============================================================================
void CCharaSelectCamera::Update(void)
{

}

//*****************************************************************************
// CGameCameraの処理
//*****************************************************************************
//=============================================================================
// コンストラクタ
//=============================================================================
CGameCamera::CGameCamera()
{
	m_State = STATE_NONE;
	m_nShakeTimer = 0;
	m_fShakeValue = 0.0f;
	m_fShakeCutValue = 0.0f;
}

//=============================================================================
// デストラクタ
//=============================================================================
CGameCamera::~CGameCamera()
{

}

//=============================================================================
// 生成処理
//=============================================================================
CGameCamera *CGameCamera::Create(void)
{
	CGameCamera *pGameCamera = NULL;

	if (pGameCamera == NULL)
	{
		pGameCamera = new CGameCamera;
		pGameCamera->Init();
	}
	return pGameCamera;
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CGameCamera::Init(void)
{
	// 共通の初期化処理
	CCamera::Init();

	// デフォルトの視点位置を保存
	m_PosVDef = GetPosV();

	// デフォルトの注視点位置を保存
	m_PosRDef = GetPosR();

	// 種類を設定
	SetType(TYPE_GAME);

	// 状態を設定
	m_State = STATE_NORMAL;

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CGameCamera::Uninit(void)
{
	// 共通の終了処理
	CCamera::Uninit();
}

//=============================================================================
// 更新処理
//=============================================================================
void CGameCamera::Update(void)
{
	switch (m_State)
	{
	case STATE_NORMAL:
		Normal();
		break;
	case STATE_SHAKE:
		Shake();
		break;
	}
}

//=============================================================================
// 通常状態の時の更新処理
//=============================================================================
void CGameCamera::Normal(void)
{

}

//=============================================================================
// 揺れる状態の時の更新処理
//=============================================================================
void CGameCamera::Shake(void)
{
	// カメラの視点位置に加える値を設定する
	D3DXVECTOR3 AddPosV = INITIALIZE_D3DXVECTOR3;
	int nRandom = (int)(D3DXToDegree(D3DX_PI * 2.0f));
	float fValue = (rand() % nRandom) - D3DXToDegree(D3DX_PI);
	fValue = D3DXToRadian(fValue);
	AddPosV.x = sinf(fValue) * m_fShakeValue;
	AddPosV.y = cosf(fValue) * m_fShakeValue;

	// カメラの注視点位置に加える値を設定する
	D3DXVECTOR3 AddPosR = INITIALIZE_D3DXVECTOR3;
	nRandom = (int)(D3DXToDegree(D3DX_PI * 2.0f));
	fValue = (rand() % nRandom) - D3DXToDegree(D3DX_PI);
	fValue = D3DXToRadian(fValue);
	AddPosR.x = sinf(fValue) * (m_fShakeValue * 0.6f);
	AddPosR.y = cosf(fValue) * (m_fShakeValue * 0.6f);

	// カメラの視点位置を設定
	SetPosV(m_PosVDef + AddPosV);
	SetPosR(m_PosRDef + AddPosR);

	// タイマーを減らす
	m_nShakeTimer--;
	if (m_nShakeTimer >= 0) { return; }
	m_nShakeTimer = 0;

	// 揺れを減らす
	m_fShakeValue -= m_fShakeCutValue;
	if (m_fShakeValue <= 0.0f)
	{
		SetPosV(m_PosVDef);
		SetPosR(m_PosRDef);
		m_fShakeValue = 0.0f;
		m_State = STATE_NORMAL;
	}
}

//=============================================================================
// 揺れる状態にする
//=============================================================================
void CGameCamera::StartShake(int nTimer, float fShake, float fShakeCut)
{
	m_nShakeTimer = nTimer;
	m_fShakeValue = fShake;
	m_fShakeCutValue = fShakeCut;
	m_State = STATE_SHAKE;
}

//=============================================================================
// 状態を設定する
//=============================================================================
void CGameCamera::SetState(const STATE state)
{
	m_State = state;
}

//=============================================================================
// 状態を取得する
//=============================================================================
CGameCamera::STATE CGameCamera::GetState(void)
{
	return m_State;
}