//*****************************************************************************
//
//     リスポーンの処理[respawn.cpp]
//     Auther:Hodaka Niwa
//
//*****************************************************************************
#include "respawn.h"
#include "manager.h"
#include "renderer.h"
#include "model.h"
#include "debugproc.h"

//*****************************************************************************
//     マクロ定義
//*****************************************************************************

//*****************************************************************************
//     静的メンバ変数
//*****************************************************************************

//=============================================================================
//    コンストラクタ
//=============================================================================
CRespawn::CRespawn()
{
	// 各種値のクリア
	m_pModel = NULL;                          // モデルクラスへのポインタ
}

//=============================================================================
//    デストラクタ
//=============================================================================
CRespawn::~CRespawn()
{

}

//=============================================================================
//    生成処理
//=============================================================================
CRespawn *CRespawn::Create(int nAreaX, int nAreaZ)
{
	CRespawn *pRespawn = NULL;  // リスポーンクラス型のポインタ
	if (pRespawn == NULL)
	{// メモリが空になっている
		pRespawn = new CRespawn;
		if (pRespawn != NULL)
		{// インスタンスを生成できた
			if (FAILED(pRespawn->Init(nAreaX, nAreaZ)))
			{// 初期化に失敗した
				return NULL;
			}
		}
		else
		{// インスタンスを生成できなかった
			return NULL;
		}
	}
	else
	{// インスタンスを生成できなかった
		return NULL;
	}

	return pRespawn;
}

//=============================================================================
//    初期化処理
//=============================================================================
HRESULT CRespawn::Init(int nAreaX, int nAreaZ)
{
	// 今いるエリアから座標を計算
	SetArea(nAreaX, nAreaZ);

	return S_OK;
}

//=============================================================================
//    終了処理
//=============================================================================
void CRespawn::Uninit(void)
{
	// モデルの破棄
	if (m_pModel != NULL)
	{
		m_pModel->Uninit();
		delete m_pModel;
		m_pModel = NULL;
	}

	// オブジェクト3Dの終了処理
	CObject3D::Uninit();
}

//=============================================================================
//    更新処理
//=============================================================================
void CRespawn::Update(void)
{

}

//=============================================================================
//    描画処理
//=============================================================================
void CRespawn::Draw(void)
{
	// レンダリングクラスの取得
	CRenderer *pRenderer = CManager::GetRenderer();
	if (pRenderer != NULL)
	{// レンダリングクラスが取得できた
		LPDIRECT3DDEVICE9 pDevice = pRenderer->GetDevice();  	// デバイスの取得
		if (pDevice != NULL)
		{// デバイスが取得できた
		    // ワールドマトリックス設定処理
			SetMtxWorld(pDevice);

			// モデルの描画
			if (m_pModel != NULL)
			{
				m_pModel->Draw();
			}
		}
	}
}

//=============================================================================
//    モデルクラス型のポインタ設定処理
//=============================================================================
void CRespawn::SetModel(CModel *pModel)
{
	m_pModel = pModel;
}

//=============================================================================
//    今どのエリアにいるかを設定
//=============================================================================
void CRespawn::SetArea(int nAreaX, int nAreaZ)
{
	// エリアを設定
	m_nAreaX = nAreaX;
	m_nAreaZ = nAreaZ;

	// エリアから座標を求める
	D3DXVECTOR3 pos = INITIALIZE_D3DXVECTOR3;
	pos.x = -((MASS_SIZE_X * MASS_BLOCK_X) / 2) + (MASS_SIZE_X * m_nAreaX) - MASS_SIZE_X_HALF;
	pos.z = ((MASS_SIZE_X* MASS_BLOCK_Z) / 2) - (MASS_SIZE_X * m_nAreaZ) + MASS_SIZE_X_HALF;
	SetPos(pos);
}

//=============================================================================
//    モデルクラス型のポインタ取得処理
//=============================================================================
CModel *CRespawn::GetModel(void)
{
	return m_pModel;
}

//=============================================================================
//    今どのエリア(横)にいるかを取得
//=============================================================================
int CRespawn::GetAreaX(void)
{
	return m_nAreaX;
}

//=============================================================================
//    今どのエリア(奥行)にいるかを取得
//=============================================================================
int CRespawn::GetAreaZ(void)
{
	return m_nAreaZ;
}