//=============================================================================
//
// ライト処理 [light.h]
// Author : Jukiya Hayakawa
//
//=============================================================================
#ifndef _LIGHT_H_
#define _LIGHT_H_

//前方宣言
#include "main.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_LIGHT (3)	//ライトの最大数

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CLight
{
public:	//誰からもアクセス可能
	//メンバ関数
	CLight();
	~CLight();
	void Init(void);
	void Uninit(void);
	void Update(void);

	//静的メンバ関数
	static CLight *Create(void);
private:	//自分だけがアクセス可能
	D3DLIGHT9 m_light[MAX_LIGHT];	//ライト情報
};
#endif
